espressif/esp-idf/examples/bluetooth/esp_ble_mesh/vendor_models/vendor_server/sdkconfig.defaults.esp32
# Override some defaults so BT stack is enabled
# by default in this example
CONFIG_IDF_TARGET="esp32"
CONFIG_BTDM_CTRL_MODE_BLE_ONLY=y
CONFIG_BTDM_CTRL_MODEM_SLEEP=n
CONFIG_BTDM_SCAN_DUPL_TYPE_DATA_DEVICE=y
CONFIG_BTDM_BLE_MESH_SCAN_DUPL_EN=y

#
# Serial flasher config
#
CONFIG_ESPTOOLPY_MONITOR_BAUD=921600

#
# ESP32-specific
#
CONFIG_ESP_CONSOLE_UART_BAUDRATE=921600
